In [ ]:
import pandas as pd

가점 = pd.read_csv('C:/Users/user/Desktop/workSpace/분석/표준분석모델/표준분석모델_교육_전기차_남양주/건물가점_전처리.csv', engine = 'python')
건물 = pd.read_csv('C:/Users/user/Desktop/workSpace/분석/표준분석모델/인천광역시_동구_전기차/work2/지자체_건물_전처리.csv', engine = 'python')

건물.rename(columns = {'BDTYP_CD' : '건물용도코드', 'BUL_MAN_NO' : '건물일련번호', 'GRO_FLO_CO' : '지상층수'}, inplace = True)

display(건물.head(2))
display(가점.head(2))

In [ ]:
merged = 건물.merge(가점, on = '건물용도코드')
merged = merged[['건물용도코드', '건물종류', '건물일련번호', '가점척도', '경도', '위도']]
merged.head()

In [3]:
가점개수 = len(merged['가점척도'].unique())
bd = [None] * 가점개수
# unipue를 사용해 가점척도 칼럼의 중복행을 제거한 뒤 그 개수만큼 빈 리스트를 생성해 bd로 지정

for i in range(가점개수):
    bd[i] = merged[merged['가점척도']==i]    
    bd[i].to_csv(f'C:/Users/user/Desktop/workSpace/분석/표준분석모델/인천광역시_동구_전기차/work2/건물{i}.csv', index=False, sep=',', encoding='cp949')    
    display(bd[i].iloc[[0]])    # iloc는 행의 넘버를 뜻함
    
for i in range(가점개수):
    print (f"{i}점 건물수:",len(bd[i]))

   건물용도코드   건물종류  건물일련번호  가점척도          경도         위도
0    1003  다가구주택     330     0  126.652147  37.478623

      건물용도코드   건물종류  건물일련번호  가점척도          경도        위도
1946    4001  일반음식점     331     1  126.652529  37.47889

      건물용도코드 건물종류  건물일련번호  가점척도          경도         위도
4405   16001  주차장     353     2  126.662211  37.483591

      건물용도코드   건물종류  건물일련번호  가점척도          경도         위도
4286    6203  대형판매점     356     3  126.660351  37.483059

0점 건물수: 3519
1점 건물수: 3451
2점 건물수: 239
3점 건물수: 5

In [1]:
import pandas as pd

df1 = pd.read_csv('C:/Users/user/Desktop/workSpace/분석/표준분석모델/인천광역시_동구_전기차/work2/전처리_데이터.csv', engine = 'python')
df2 = pd.read_csv('C:/Users/user/Desktop/workSpace/분석/표준분석모델/인천광역시_동구_전기차/work2/격자_위경도.csv', engine = 'python')

display(df1.head(2))
display(df2.head(2))
display(df1.shape)
display(df2.shape)

        gid  주차장  건물1  건물2  건물3  경제인구  관공서  전기차  충전소
0  다사192446  NaN    1    0    0   NaN    0    0    0
1  다사193445  NaN    3    0    0   NaN    0    0    0

        gid          경도         위도
0  다사192446  126.586475  37.497583
1  다사193445  126.587617  37.496690

(860, 9)

(860, 3)

In [2]:
df3 = pd.merge(df1, df2, on='gid')
df3.head()

        gid  주차장  건물1  건물2  건물3  경제인구  관공서  전기차  충전소          경도         위도
0  다사192446  NaN    1    0    0   NaN    0    0    0  126.586475  37.497583
1  다사193445  NaN    3    0    0   NaN    0    0    0  126.587617  37.496690
2  다사193447  NaN    2    0    0   NaN    0    0    0  126.587596  37.498492
3  다사194445  NaN    2    0    0   NaN    0    0    0  126.588749  37.496699
4  다사194446  NaN    0    0    0   NaN    0    0    0  126.588738  37.497600

In [3]:
df3 = df3.fillna(0)
print(df3.head())
print(df3.shape)

        gid  주차장  건물1  건물2  건물3  경제인구  관공서  전기차  충전소          경도         위도
0  다사192446  0.0    1    0    0   0.0    0    0    0  126.586475  37.497583
1  다사193445  0.0    3    0    0   0.0    0    0    0  126.587617  37.496690
2  다사193447  0.0    2    0    0   0.0    0    0    0  126.587596  37.498492
3  다사194445  0.0    2    0    0   0.0    0    0    0  126.588749  37.496699
4  다사194446  0.0    0    0    0   0.0    0    0    0  126.588738  37.497600
(860, 11)

In [4]:
df3.to_csv('C:/Users/user/Desktop/workSpace/분석/표준분석모델/인천광역시_동구_전기차/work2/인천광역시_동구_데이터전처리.csv', index = False, encoding = 'cp949')

In [1]:
import pandas as pd

df4 = pd.read_csv('C:/Users/user/Desktop/workSpace/분석/표준분석모델/인천광역시_동구_전기차/work2/인천광역시_동구_전기차_버퍼.csv',
                  engine = 'python')
df4.head()

        gid  Unnamed: 1
0  다사242425         NaN
1  다사242426         NaN
2  다사242427         NaN
3  다사242428         NaN
4  다사242429         NaN

In [2]:
df4 = df4.drop(columns = ['Unnamed: 1'])
df4.head()

        gid
0  다사242425
1  다사242426
2  다사242427
3  다사242428
4  다사242429

In [3]:
df4.insert(1,'거리_전기차',1)
df4.head()

        gid  거리_전기차
0  다사242425       1
1  다사242426       1
2  다사242427       1
3  다사242428       1
4  다사242429       1

In [4]:
df4.to_csv('C:/Users/user/Desktop/workSpace/분석/표준분석모델/인천광역시_동구_전기차/work2/인천광역시_동구_전기차_거리.csv', index = False, encoding = 'cp949')

In [23]:
from haversine import haversine

In [24]:
df000 = df3[df3['전기차'] != 0]

In [25]:
for j in range(0, len(df3)):
    for i in range(0, len(df000)):
        lon = df3['경도'][j]
        lat = df3['위도'][j]
        lon2 = df000['경도'].reset_index(drop = True)[i]
        lat2 = df000['위도'].reset_index(drop = True)[i]
        a = (lat, lon)
        b = (lat2, lon2)
        c = haversine(a, b) * 1000
        if c <= 200:
            df3['거리_전기차']['j'] = 1

<ipython-input-25-663b3a396993>:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['거리_전기차']['j'] = 1

In [29]:
df3[df3['거리_전기차'] != 0]

<ipython-input-29-4f2ea0ade23c>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df3[df3['거리_전기차'] != 0]

Empty DataFrame
Columns: [gid, 주차장, 건물1, 건물2, 건물3, 경제인구, 관공서, 전기차, 충전소, 경도, 위도, 거리_전기차]
Index: []

In [31]:
function(selectedColumn){
  df0 <- df3
  df0$index <- c(1:nrow(df0))
  df1 <- subset(df0, selectedColumn == 0)
  df2 <- subset(df0, selectedColumn != 0)
  result <- ifelse(selectedColumn != 0,0,1)
  for(i in 1:nrow(df1)){
    for(j in 1:nrow(df2)){
      loc1 <- c(df1$경도[i], df1$위도[i])
      loc2 <- c(df2$경도[j], df2$위도[j])
      dist <- haversine(loc1, loc2)
      if(dist <= 0.5){
        result[df1$index[i]] <- 1
        break
      }
    }
  }
  return(result)
}(전기차)

SyntaxError: invalid syntax (<ipython-input-31-714317138c70>, line 1)

SyntaxError: invalid syntax (<ipython-input-33-4ee572e6198c>, line 1)